       IDENTIFICATION DIVISION.
       PROGRAM-ID. CodingExercise.
       AUTHOR. Janis Michael.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F01-PEOPLE-FILE
                  ASSIGN TO 'People.dat'
                  ORGANIZATION IS LINE SEQUENTIAL.
           SELECT F02-PEOPLEREPORT-FILE
                  ASSIGN TO 'PeopleReport.dat'
                  ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD  F01-PEOPLE-FILE
           RECORD CONTAINS 33 CHARACTERS
           DATA RECORD IS F01-INPUT-RECORD.
       01 F01-INPUT-RECORD.
         05 F01-NAME PIC X(25).
         05 F01-AGE PIC 99.
         05 F01-WEEKLY-SALARY PIC 9(4)V99.
       FD  F02-PEOPLEREPORT-FILE
           RECORD CONTAINS 44 CHARACTERS
           DATA RECORD IS F02-OUTPUT-RECORD.
       01 F02-OUTPUT-RECORD PIC X(44).

       WORKING-STORAGE SECTION.
       01 W01-DATA-REMAINS-SWITCH PIC X(2) VALUE SPACES.
       01 W02-MAIN-HEADING.
         05 PIC X(15) VALUE SPACES.
         05 PIC X(9) VALUE 'Coding Exercise'.
         05 PIC X(20) VALUE SPACES.
       01 W04-DETAIL-LINE.
         05 W04-NAME PIC X(25).
         05 PIC X(4) VALUE SPACES.
         05 W04-AGE PIC 99.
         05 PIC X(4) VALUE SPACES.
         05 W04-WEEKLY-SALARY PIC $9,999.99.

       PROCEDURE DIVISION.
           OPEN INPUT F01-PEOPLE-FILE
             OUTPUT F02-PEOPLEREPORT-FILE
           READ F01-PEOPLE-FILE
               AT END
                   MOVE 'NO' TO W01-DATA-REMAINS-SWITCH
           END-READ.
           PERFORM WRITE-HEADING-LINE
           PERFORM PROCESS-RECORDS
             UNTIL W01-DATA-REMAINS-SWITCH = 'NO'
           CLOSE F01-PEOPLE-FILE
             F02-PEOPLEREPORT-FILE
           STOP RUN.
       WRITE-HEADING-LINE.
           MOVE W02-MAIN-HEADING TO F02-OUTPUT-RECORD
           WRITE F02-OUTPUT-RECORD.

       PROCESS-RECORDS.
           MOVE F01-NAME TO W04-NAME
           MOVE F01-AGE TO W04-AGE
           MOVE F01-WEEKLY-SALARY TO W04-WEEKLY-SALARY
           MOVE W04-DETAIL-LINE TO F02-OUTPUT-RECORD
           WRITE F02-OUTPUT-RECORD
           READ F01-PEOPLE-FILE
               AT END
                   MOVE 'NO' TO W01-DATA-REMAINS-SWITCH
           END-READ.
